# 1. Create schema in HMS

In [2]:
%%sql

-- Check metastore status
--show schemas from hms;
--show tables from hms.nyc100;
--drop table hms.nyc_taxis_db.test;
--drop schema hms.nyc;

CREATE DATABASE nyc_taxis_db LOCATION 's3a://datalake/warehouse/nyc_taxis_db';

++
||
++
++

# 2. Spark example with Python API

In [1]:
initial_data_df = spark.read.parquet("s3a://datalake/files/sales_summary")
initial_data_df.show()

24/03/26 21:01:17 WARN MetricsConfig: Cannot locate configuration: tried hadoop-metrics2-s3a-file-system.properties,hadoop-metrics2.properties

+-------------------+----------------------+--------------------+------------------+---------------------+----------------+-------------+----------------+-----------+--------+-------------------+
|ProductCategoryName|ProductSubcategoryName|         ProductName|      CustomerName|SalesTerritoryCountry|SalesOrderNumber|OrderQuantity|TotalProductCost|SalesAmount|  TaxAmt|          OrderDate|
+-------------------+----------------------+--------------------+------------------+---------------------+----------------+-------------+----------------+-----------+--------+-------------------+
|              Bikes|            Road Bikes|    Road-150 Red, 62|       Cole Watson|               Canada|         SO43697|            1|       2171.2942|    3578.27|286.2616|2010-12-29 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|  Rachael Martinez|               France|         SO43698|            1|       1912.1544|    3399.99|271.9992|2010-12-29 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|     Sydney Wright|        United States|         SO43699|            1|       1912.1544|    3399.99|271.9992|2010-12-29 00:00:00|
|              Bikes|            Road Bikes|  Road-650 Black, 62|      Ruben Prasad|        United States|         SO43700|            1|        413.1463|   699.0982| 55.9279|2010-12-29 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|       Christy Zhu|            Australia|         SO43701|            1|       1912.1544|    3399.99|271.9992|2010-12-29 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 44|       Colin Anand|        United States|         SO43702|            1|       2171.2942|    3578.27|286.2616|2010-12-30 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 62|    Albert Alvarez|            Australia|         SO43703|            1|       2171.2942|    3578.27|286.2616|2010-12-30 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Blac...|        Julio Ruiz|            Australia|         SO43704|            1|       1898.0944|    3374.99|269.9992|2010-12-30 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|         Curtis Lu|            Australia|         SO43705|            1|       1912.1544|    3399.99|271.9992|2010-12-30 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 48|      Edward Brown|        United States|         SO43706|            1|       2171.2942|    3578.27|286.2616|2010-12-31 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 48|        Emma Brown|        United States|         SO43707|            1|       2171.2942|    3578.27|286.2616|2010-12-31 00:00:00|
|              Bikes|            Road Bikes|    Road-650 Red, 52|         Brad Deng|       United Kingdom|         SO43708|            1|        413.1463|   699.0982| 55.9279|2010-12-31 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 52|         Martha Xu|            Australia|         SO43709|            1|       2171.2942|    3578.27|286.2616|2010-12-31 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 56|      Katrina Raji|            Australia|         SO43710|            1|       2171.2942|    3578.27|286.2616|2010-12-31 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 56|  Courtney Edwards|        United States|         SO43711|            1|       2171.2942|    3578.27|286.2616|2011-01-01 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 44| Abigail Henderson|              Germany|         SO43712|            1|       2171.2942|    3578.27|286.2616|2011-01-01 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 62|     Sydney Rogers|        United States|         SO43713|            1|       2171.2942|    3578.27|286.2616|2011-01-02 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 44|    Latasha Alonso|       United Kingdom|         SO43714|            1|       2171.2942|    3578.27|286.2616|2011-01-02 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 56|        Warren Jai|            Australia|         SO43715|            1|       2171.2942|    3578.27|286.2616|2011-01-02 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 44|Jonathon Gutierrez|            Australia|         SO43716|            1|       2171.2942|    3578.27|286.2616|2011-01-02 00:00:00|
+-------------------+----------------------+--------------------+------------------+---------------------+----------------+-------------+----------------+-----------+--------+-------------------+
only showing top 20 rows

## 2.1 Create Iceberg table in HMS catalog

In [2]:
TAXIS_TABLE="hms.nyc_taxis_db.trips"

In [7]:
initial_data_df.writeTo(TAXIS_TABLE).create()

## 2.3 Read Hive table

In [8]:
spark.read.table(TAXIS_TABLE).show()

+-------------------+----------------------+--------------------+------------------+---------------------+----------------+-------------+----------------+-----------+--------+-------------------+
|ProductCategoryName|ProductSubcategoryName|         ProductName|      CustomerName|SalesTerritoryCountry|SalesOrderNumber|OrderQuantity|TotalProductCost|SalesAmount|  TaxAmt|          OrderDate|
+-------------------+----------------------+--------------------+------------------+---------------------+----------------+-------------+----------------+-----------+--------+-------------------+
|              Bikes|            Road Bikes|    Road-150 Red, 62|       Cole Watson|               Canada|         SO43697|            1|       2171.2942|    3578.27|286.2616|2010-12-29 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|  Rachael Martinez|               France|         SO43698|            1|       1912.1544|    3399.99|271.9992|2010-12-29 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|     Sydney Wright|        United States|         SO43699|            1|       1912.1544|    3399.99|271.9992|2010-12-29 00:00:00|
|              Bikes|            Road Bikes|  Road-650 Black, 62|      Ruben Prasad|        United States|         SO43700|            1|        413.1463|   699.0982| 55.9279|2010-12-29 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|       Christy Zhu|            Australia|         SO43701|            1|       1912.1544|    3399.99|271.9992|2010-12-29 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 44|       Colin Anand|        United States|         SO43702|            1|       2171.2942|    3578.27|286.2616|2010-12-30 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 62|    Albert Alvarez|            Australia|         SO43703|            1|       2171.2942|    3578.27|286.2616|2010-12-30 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Blac...|        Julio Ruiz|            Australia|         SO43704|            1|       1898.0944|    3374.99|269.9992|2010-12-30 00:00:00|
|              Bikes|        Mountain Bikes|Mountain-100 Silv...|         Curtis Lu|            Australia|         SO43705|            1|       1912.1544|    3399.99|271.9992|2010-12-30 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 48|      Edward Brown|        United States|         SO43706|            1|       2171.2942|    3578.27|286.2616|2010-12-31 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 48|        Emma Brown|        United States|         SO43707|            1|       2171.2942|    3578.27|286.2616|2010-12-31 00:00:00|
|              Bikes|            Road Bikes|    Road-650 Red, 52|         Brad Deng|       United Kingdom|         SO43708|            1|        413.1463|   699.0982| 55.9279|2010-12-31 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 52|         Martha Xu|            Australia|         SO43709|            1|       2171.2942|    3578.27|286.2616|2010-12-31 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 56|      Katrina Raji|            Australia|         SO43710|            1|       2171.2942|    3578.27|286.2616|2010-12-31 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 56|  Courtney Edwards|        United States|         SO43711|            1|       2171.2942|    3578.27|286.2616|2011-01-01 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 44| Abigail Henderson|              Germany|         SO43712|            1|       2171.2942|    3578.27|286.2616|2011-01-01 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 62|     Sydney Rogers|        United States|         SO43713|            1|       2171.2942|    3578.27|286.2616|2011-01-02 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 44|    Latasha Alonso|       United Kingdom|         SO43714|            1|       2171.2942|    3578.27|286.2616|2011-01-02 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 56|        Warren Jai|            Australia|         SO43715|            1|       2171.2942|    3578.27|286.2616|2011-01-02 00:00:00|
|              Bikes|            Road Bikes|    Road-150 Red, 44|Jonathon Gutierrez|            Australia|         SO43716|            1|       2171.2942|    3578.27|286.2616|2011-01-02 00:00:00|
+-------------------+----------------------+--------------------+------------------+---------------------+----------------+-------------+----------------+-----------+--------+-------------------+
only showing top 20 rows

# 3. Spark SQL example

In [34]:
%%sql
CREATE TABLE hms.nyc100.taxis_new
(
  vendor_id bigint,
  trip_id bigint,
  trip_distance float,
  fare_amount double,
  store_and_fwd_flag string
)
PARTITIONED BY (vendor_id);

++
||
++
++

In [2]:
%%sql
INSERT INTO hms.nyc100.taxis_new
VALUES (1, 1000371, 1.8, 15.32, 'N'), (2, 1000372, 2.5, 22.15, 'N'), (2, 1000373, 0.9, 9.01, 'N'), (1, 1000374, 8.4, 42.13, 'Y');

++
||
++
++

In [3]:
%%sql
SELECT * FROM hms.nyc100.taxis_new;

+-----------+---------+--------------------+-------------+--------------------+
| vendor_id | trip_id |      trip_distance | fare_amount | store_and_fwd_flag |
+-----------+---------+--------------------+-------------+--------------------+
|         1 | 1000371 | 1.7999999523162842 |       15.32 |                  N |
|         1 | 1000374 |  8.399999618530273 |       42.13 |                  Y |
|         2 | 1000372 |                2.5 |       22.15 |                  N |
|         2 | 1000373 | 0.8999999761581421 |        9.01 |                  N |
|         1 | 1000371 | 1.7999999523162842 |       15.32 |                  N |
|         1 | 1000374 |  8.399999618530273 |       42.13 |                  Y |
|         2 | 1000372 |                2.5 |       22.15 |                  N |
|         2 | 1000373 | 0.8999999761581421 |        9.01 |                  N |
+-----------+---------+--------------------+-------------+--------------------+